test/non-functional/gatling/src/test/resources/bodies/GetCareDocumentationRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:description:GetCareDocumentationResponder:2" xmlns:urn2="urn:riv:clinicalprocess:healthcond:description:2">
   <soapenv:Header>
      <urn:LogicalAddress>VS-1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetCareDocumentation>
         <!--Zero or more repetitions:-->
         <urn1:careUnitHSAid>${careUnitHSAId}</urn1:careUnitHSAid>
         <urn1:patientId>
            <urn2:id>192712039550</urn2:id>
            <urn2:type>?</urn2:type>
            <!--You may enter ANY elements at this point-->
         </urn1:patientId>
         <!--Optional:-->
         <urn1:sourceSystemHSAid>?</urn1:sourceSystemHSAid>
         <!--Zero or more repetitions:-->
         <urn1:careContactId>?</urn1:careContactId>
         <!--You may enter ANY elements at this point-->
      </urn1:GetCareDocumentation>
   </soapenv:Body>
</soapenv:Envelope>